import math

# базовые константы
WIDTH = 1600
HEIGHT = 900

FPS = 60

# настройки игрока
PLAYER_POS = (1.5, 1.5)
PLAYER_SPEED = 0.004
PLAYER_ROT_SPEED = 0.002
PLAYER_SIZE = 60

# настройка видимости игрока
PLAYER_FOV = math.pi / 3
RAYS_NUM = WIDTH // 2
DELTA_ANGLE = PLAYER_FOV / RAYS_NUM
MAX_DEPTH = 25

SCREEN_DIST = (WIDTH // 2) / math.tan(PLAYER_FOV / 2)
SCALE = 2

# настройки мыши
SENSIVITY = 0.0001
BORDER_LEFT = 400
BORDER_RIGHT = 1100
BORDER_DOWN = 500
MAX_REL = 40

# Константы для PHP слоников на каждом уровнем
OBJECTS_COORDS = {
    1: ((6.5, 3.5), (1.5, 7.5), (13.5, 1.5), (8.3, 4.5), (11.5, 7.5)),
    2: ((30.5, 15.5), (27.5, 16.5), (29.5, 11.5), (5.5, 6.5), (1.5, 14.5), (12.5, 16.5), (22.7, 2.7),
        (14.5, 4.5), (16.5, 9.5), (1.5, 3.5)),
    3: ((1.5, 16.5), (2.5, 3.5), (12.5, 7.5), (17.5, 1.5), (26.5, 12.5), (13.5, 11.5), (30.5, 15.5),
        (18.5, 4.5), (17.5, 4.5), (16.5, 4.5), (15.5, 4.5), (29.5, 6.5), (20.5, 5.5), (7.5, 15.5))
}
NUMBER_OF_PHPS = {1: 5, 2: 10, 3: 14}

FG = {32: ' ', 45: '_',
      48: 0, 49: 1, 50: 2, 51: 3, 52: 4, 53: 5, 54: 6, 55: 7, 56: 8, 57: 9,
      97: 'A', 98: 'B', 99: 'C', 100: 'D', 101: 'E', 102: 'F', 103: 'G',
      104: 'H', 105: 'I', 106: 'J', 107: 'K', 108: 'L', 109: 'M', 110: 'N',
      111: 'O', 112: 'P', 113: 'Q', 114: 'R', 115: 'S', 116: 'T', 117: 'U',
      118: 'V', 119: 'W', 120: 'X', 121: 'Y', 122: 'Z'}
